# Найти входит ли в число "N" числа 3 и 7
N = 3738
# Выводим на экран, предварительно преобразовав в строку str
# Наличие 'символа' в строке проверяет оператор in
print('3' in str(N) and '7' in str(N))
