# Вывести количество уникальных символов во входящем тексте:
text = input("Введите текст:")
unique = set(text)
print("Количество уникальных символов:", len(unique))
